====================EDA packages===========================
- Pandas: Data Frame Apllications
- Numpy : Numerical Python for math applications
- Matplotlib : used for plotting
- Seaborn : used for plot
- plotly : used for plot
- Bokhe : used for plot

===================Machine Learning packages==================
- Sickit-learn : sklearn

====================Deep Learning ============================
- Tensorflow : Google
- Keras : Google
- Pytorch : Facebook

=========================NLP===================================
- NLTK : Natural Language Toolkit
- Scipy

======================BERT======================================
- Transformers : Hugging face (Google)

==================Google Models===================================
- Specific Google Packages

=========================Azure ML=================================
- Azure packages

=======================GenAI==========================================
- Gemini : Google
- chatGPT : OpenAI

===========================LangChain================================
- LangChain packages

## Create a data frame using list

In [2]:
import pandas as pd
names = ['Ayush', 'Avinash', 'Aakash']
#Step1 - Create an empty dataframe
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [6]:
#Step2 : Provide the data to data frame
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2   Aakash

In [10]:
age = [20,25,30]
pd.DataFrame(zip(names,age))

         0   1
0    Ayush  20
1  Avinash  25
2   Aakash  30

In [11]:
city = ['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  20      hyd
1  Avinash  25      blr
2   Aakash  30  chennai

In [13]:
#First position is data
#second position is index
pd.DataFrame(zip(names,age),city)

               0   1
hyd        Ayush  20
blr      Avinash  25
chennai   Aakash  30

** Provide the column names**

In [15]:
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

     Names  Age     City
0    Ayush   20      hyd
1  Avinash   25      blr
2   Aakash   30  chennai

In [16]:
cols = ['Names','Age','City']
pd.DataFrame(zip(names,age,city),columns=cols)

     Names  Age     City
0    Ayush   20      hyd
1  Avinash   25      blr
2   Aakash   30  chennai

In [17]:
df = pd.DataFrame(zip(names,age,city),columns=cols)
type(df)

pandas.core.frame.DataFrame

** Add new column **
- First check number of rows in the existing data frame
- For example in the above data frame we have 3 rows
- Need to create a new list with 3 rows
- Then equate that list to the dataframe

In [18]:
job=['DS','DE','CS']
df['Job'] = job
df

     Names  Age     City Job
0    Ayush   20      hyd  DS
1  Avinash   25      blr  DE
2   Aakash   30  chennai  CS

** Update existing column **

In [19]:
age = [30,24,23]
df['Age']=age
df

     Names  Age     City Job
0    Ayush   30      hyd  DS
1  Avinash   24      blr  DE
2   Aakash   23  chennai  CS

** How to change the index **

In [20]:
index = ['A', 'B', 'C']
df = pd.DataFrame(zip(names,age,city),index=index,columns=cols)
df

     Names  Age     City
A    Ayush   30      hyd
B  Avinash   24      blr
C   Aakash   23  chennai

# Note: 

- Number of lists are equal to **number of columns**
- Number of values inside list are equal to **number of rows**

**Shape**
- Number of rows 
- Number of columns

In [25]:
df.shape
print(f"The number of rows are = {df.shape[0]}")

print(f"The number of columns are = {df.shape[1]}")

The number of rows are = 3
The number of columns are = 3

**Drop the column**

- To drop the column we need 3 parameters
- 
      - Column name : name of the column to be dropped
  
      - axis
          axis=0: ***represents rows***
          axis=1: ***represents columns***
      - inplace  
          when we are dropping the column that means we are modifying the data frame
          inplace = true means ***After modifying we want to keep in the same variable***
          inplace = false means ***After modifying we want to keep in the different variable***

In [27]:
df.drop('City',axis=1,inplace=True)
df

     Names  Age
A    Ayush   30
B  Avinash   24
C   Aakash   23

In [28]:
df.drop('Age',axis=1)
df

     Names  Age
A    Ayush   30
B  Avinash   24
C   Aakash   23

In [30]:
new_df=df.drop('Age',axis=1)
new_df

     Names
A    Ayush
B  Avinash
C   Aakash

**Drop multiple columns**

In [32]:
import pandas as pd
names = ['Ayush', 'Avinash', 'Aakash']
city = ['hyd','blr','chennai']
age = [20,25,30]
cols = ['Names','Age','City']
df = pd.DataFrame(zip(names,age,city),columns=cols)
df.drop(['Age','City'],axis=1,inplace=True)
df

     Names
0    Ayush
1  Avinash
2   Aakash

**Drop rows**

In [37]:
import pandas as pd
names = ['Ayush', 'Avinash', 'Aakash']
city = ['hyd','blr','chennai']
age = [20,25,30]
cols = ['Names','Age','City']
index = ['A', 'B', 'C']
df = pd.DataFrame(zip(names,age,city),index=index,columns=cols)

df.drop('A',axis=0,inplace=True)
df

     Names  Age     City
B  Avinash   25      blr
C   Aakash   30  chennai

**Save the data frame**

- Generally data frames are two types
    - csv
    - excel

**CSV**

In [39]:
#filename - data.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False) # index will not be displayed

**excel**

In [40]:
df.to_excel('data.xlsx')